Revit 2024 API
FabricationConfiguration.LocateInsulationSpecification Method
 Gets the insulation specification by group and name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int LocateInsulationSpecification(
	string group,
	string name
)
Visual Basic
Public Function LocateInsulationSpecification ( _
	group As String, _
	name As String _
) As Integer
Visual C++
public:
int LocateInsulationSpecification(
	String^ group,
	String^ name
)
Parameters
group
Type: System.String
 The insulation specification group.
name
Type: System.String
 The insulation specification name.
Return Value
 The insulation specification identifier. Returns -1 if not found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace